constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontandback
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          141400;
        startFace       140810;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          280;
        startFace       282210;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          560;
        startFace       282490;
    }
    outlet
    {
        type            patch;
        nFaces          170;
        startFace       283050;
    }
    inlet
    {
        type            patch;
        nFaces          170;
        startFace       283220;
    }
)

// ************************************************************************* //
