system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

	ddtSchemes
	{
    		default         CrankNicolson 0.5;
	}

	gradSchemes
	{
		default		Gauss linear;	
	}

	divSchemes
	{
    		default         none;
    		div(phi,U)      Gauss LUST grad(U);
		div((nuEff*dev2(T(grad(U))))) Gauss linear;  
	}

	laplacianSchemes
	{
    		default         Gauss linear corrected;
	}

	interpolationSchemes
	{
   		 default     	linear;
	}

	snGradSchemes
	{
    		default         corrected;
	}


// ************************************************************************* //
