system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


solvers
{
	p
	{
		solver 		GAMG;		
		preconditioner    FDIC;
		mergeLevels       1;
		smoother          GaussSeidel;
		agglomerator      faceAreaPair;
		nCellsInCoarsestLevel   100;
		tolerance         1e-05;
		relTol            0.1;
		
	}
	
	pFinal
	{
		$p;
        	tolerance       1e-05;
        	relTol          0;
	}

	U
	{
		solver 		GAMG;		
		preconditioner    DILU;
		mergeLevels       1;
		smoother          GaussSeidel;
		agglomerator      faceAreaPair;
		nCellsInCoarsestLevel   100;
		tolerance         1e-05;
		relTol            0;
		
	}	

}

	PISO
	{
    		nCorrectors     2;
    		nNonOrthogonalCorrectors 1;
    		pRefCell        0;
    		pRefValue       0;
	}



// ************************************************************************* //
